In [1]:
import pandas as pd
from sqlalchemy import create_engine, text

In [2]:
url = "mysql+pymysql://root:root@localhost:3306/mlops"
engine = create_engine(url)

In [3]:
sql = "select * from mlops.customer_info";

In [ ]:
with engine.connect() as conn:
    df = pd.read_sql(text(sql),con=conn)
    print(df)

           id customer_id        date           name        ssn
0      100127       23186  2025-06-12        Gillams  486471751
1      100138        6601  2025-05-12         Cableo  534541028
2      100188       42573  2025-07-30  Nick Edwardsl  190660409
3      100234       36210  2025-05-30      Hideyukih  200137091
4      100236       36210  2025-07-30      Hideyukih  200137091
...       ...         ...         ...            ...        ...
19995   99946       19334  2025-05-03     Nachtigalh  942965677
19996   99978       20482  2025-01-25    Ann Saphird  913935303
19997   99982       20482  2025-05-27    Ann Saphird  913935303
19998   99991       13373  2025-02-27     Joseph A.p   45126597
19999   99993       13373  2025-04-27     Joseph A.p   45126597

[20000 rows x 5 columns]

In [ ]:
df

           id customer_id        date           name        ssn
0      100127       23186  2025-06-12        Gillams  486471751
1      100138        6601  2025-05-12         Cableo  534541028
2      100188       42573  2025-07-30  Nick Edwardsl  190660409
3      100234       36210  2025-05-30      Hideyukih  200137091
4      100236       36210  2025-07-30      Hideyukih  200137091
...       ...         ...         ...            ...        ...
19995   99946       19334  2025-05-03     Nachtigalh  942965677
19996   99978       20482  2025-01-25    Ann Saphird  913935303
19997   99982       20482  2025-05-27    Ann Saphird  913935303
19998   99991       13373  2025-02-27     Joseph A.p   45126597
19999   99993       13373  2025-04-27     Joseph A.p   45126597

[20000 rows x 5 columns]